/* automatically generated by rust-bindgen */

pub const THOST_FTDC_EXP_Normal: u8 = 48u8;
pub const THOST_FTDC_EXP_GenOrderByTrade: u8 = 49u8;
pub const THOST_FTDC_ICT_EID: u8 = 48u8;
pub const THOST_FTDC_ICT_IDCard: u8 = 49u8;
pub const THOST_FTDC_ICT_OfficerIDCard: u8 = 50u8;
pub const THOST_FTDC_ICT_PoliceIDCard: u8 = 51u8;
pub const THOST_FTDC_ICT_SoldierIDCard: u8 = 52u8;
pub const THOST_FTDC_ICT_HouseholdRegister: u8 = 53u8;
pub const THOST_FTDC_ICT_Passport: u8 = 54u8;
pub const THOST_FTDC_ICT_TaiwanCompatriotIDCard: u8 = 55u8;
pub const THOST_FTDC_ICT_HomeComingCard: u8 = 56u8;
pub const THOST_FTDC_ICT_LicenseNo: u8 = 57u8;
pub const THOST_FTDC_ICT_TaxNo: u8 = 65u8;
pub const THOST_FTDC_ICT_HMMainlandTravelPermit: u8 = 66u8;
pub const THOST_FTDC_ICT_TwMainlandTravelPermit: u8 = 67u8;
pub const THOST_FTDC_ICT_DrivingLicense: u8 = 68u8;
pub const THOST_FTDC_ICT_SocialID: u8 = 70u8;
pub const THOST_FTDC_ICT_LocalID: u8 = 71u8;
pub const THOST_FTDC_ICT_BusinessRegistration: u8 = 72u8;
pub const THOST_FTDC_ICT_HKMCIDCard: u8 = 73u8;
pub const THOST_FTDC_ICT_AccountsPermits: u8 = 74u8;
pub const THOST_FTDC_ICT_FrgPrmtRdCard: u8 = 75u8;
pub const THOST_FTDC_ICT_CptMngPrdLetter: u8 = 76u8;
pub const THOST_FTDC_ICT_UniformSocialCreditCode: u8 = 78u8;
pub const THOST_FTDC_ICT_CorporationCertNo: u8 = 79u8;
pub const THOST_FTDC_ICT_OtherCard: u8 = 120u8;
pub const THOST_FTDC_IR_All: u8 = 49u8;
pub const THOST_FTDC_IR_Group: u8 = 50u8;

pub type TThostFtdcClientSystemInfoType = [::std::os::raw::c_char; 273usize];
#[doc = ""]
#[doc = "TFtdcAdditionalInfoType"]
#[doc = ""]
pub type TThostFtdcAdditionalInfoType = [::std::os::raw::c_char; 261usize];
#[doc = ""]
#[doc = "TFtdcBase64ClientSystemInfoTypebase64"]
#[doc = ""]
pub type TThostFtdcBase64ClientSystemInfoType = [::std::os::raw::c_char; 365usize];
#[doc = ""]
#[doc = "TFtdcBase64AdditionalInfoTypebase64"]
#[doc = ""]
pub type TThostFtdcBase64AdditionalInfoType = [::std::os::raw::c_char; 349usize];
#[doc = ""]
#[doc = "TFtdcCurrentAuthMethodType\u{5a4}0\u{5a4} A\u{5a4}\u{32c}\u{e8ec}\u{5a4}"]
#[doc = ""]
pub type TThostFtdcCurrentAuthMethodType = ::std::os::raw::c_int;
#[doc = ""]
#[doc = "TFtdcCaptchaInfoLenType\u{5a4}"]
#[doc = ""]
pub type TThostFtdcCaptchaInfoLenType = ::std::os::raw::c_int;
#[doc = ""]
#[doc = "TFtdcCaptchaInfoType\u{5a4}"]
#[doc = ""]
pub type TThostFtdcCaptchaInfoType = [::std::os::raw::c_char; 2561usize];
#[doc = ""]
#[doc = "TFtdcUserTextSeqType\u{5a4}"]
#[doc = ""]
pub type TThostFtdcUserTextSeqType = ::std::os::raw::c_int;
#[doc = ""]
#[doc = "TFtdcHandshakeDataType"]
#[doc = ""]
pub type TThostFtdcHandshakeDataType = [::std::os::raw::c_char; 301usize];
#[doc = ""]
#[doc = "TFtdcHandshakeDataLenType"]
#[doc = ""]
pub type TThostFtdcHandshakeDataLenType = ::std::os::raw::c_int;
#[doc = ""]
#[doc = "TFtdcCryptoKeyVersionTypeapifront\u{368}"]
#[doc = ""]
pub type TThostFtdcCryptoKeyVersionType = [::std::os::raw::c_char; 31usize];
#[doc = ""]
#[doc = "TFtdcRsaKeyVersionType"]
#[doc = ""]
pub type TThostFtdcRsaKeyVersionType = ::std::os::raw::c_int;
#[doc = ""]
#[doc = "TFtdcSoftwareProviderIDTypeID"]
#[doc = ""]
pub type TThostFtdcSoftwareProviderIDType = [::std::os::raw::c_char; 22usize];
#[doc = ""]
#[doc = "TFtdcCollectTimeType"]
#[doc = ""]
pub type TThostFtdcCollectTimeType = [::std::os::raw::c_char; 21usize];
#[doc = ""]
#[doc = "TFtdcQueryFreqType"]
#[doc = ""]
pub type TThostFtdcQueryFreqType = ::std::os::raw::c_int;
pub type TThostFtdcResponseValueType = ::std::os::raw::c_char;
pub type TThostFtdcOTCTradeTypeType = ::std::os::raw::c_char;
pub type TThostFtdcMatchTypeType = ::std::os::raw::c_char;
#[doc = ""]
#[doc = "TFtdcOTCTraderIDTypeOTC"]
#[doc = ""]
pub type TThostFtdcOTCTraderIDType = [::std::os::raw::c_char; 31usize];
#[doc = ""]
#[doc = "TFtdcRiskValueType\u{5b5}"]
#[doc = ""]
pub type TThostFtdcRiskValueType = f64;
#[doc = ""]
#[doc = "TFtdcIDBNameType"]
#[doc = ""]
pub type TThostFtdcIDBNameType = [::std::os::raw::c_char; 100usize];
#[doc = "\u{5b7}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcDisseminationField {
    #[doc = ""]
    pub SequenceSeries: TThostFtdcSequenceSeriesType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
}
#[test]
fn bindgen_test_layout_CThostFtdcDisseminationField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcDisseminationField>(),
        8usize,
        concat!("Size of: ", stringify!(CThostFtdcDisseminationField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcDisseminationField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcDisseminationField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDisseminationField>())).SequenceSeries as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDisseminationField),
            "::",
            stringify!(SequenceSeries)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDisseminationField>())).SequenceNo as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDisseminationField),
            "::",
            stringify!(SequenceNo)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcReqUserLoginField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub InterfaceProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub ProtocolInfo: TThostFtdcProtocolInfoType,
    #[doc = "Mac\u{5b7}"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = "\u{32c}"]
    pub OneTimePassword: TThostFtdcPasswordType,
    #[doc = "IP\u{5b7}"]
    pub ClientIPAddress: TThostFtdcIPAddressType,
    #[doc = ""]
    pub LoginRemark: TThostFtdcLoginRemarkType,
    #[doc = "IP"]
    pub ClientIPPort: TThostFtdcIPPortType,
}
#[test]
fn bindgen_test_layout_CThostFtdcReqUserLoginField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcReqUserLoginField>(),
        228usize,
        concat!("Size of: ", stringify!(CThostFtdcReqUserLoginField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcReqUserLoginField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcReqUserLoginField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).TradingDay as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).BrokerID as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).UserID as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).Password as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).UserProductInfo as *const _
                as usize
        },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).InterfaceProductInfo as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(InterfaceProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).ProtocolInfo as *const _
                as usize
        },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ProtocolInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).MacAddress as *const _ as usize
        },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).OneTimePassword as *const _
                as usize
        },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(OneTimePassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).ClientIPAddress as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ClientIPAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).LoginRemark as *const _ as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(LoginRemark)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqUserLoginField>())).ClientIPPort as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqUserLoginField),
            "::",
            stringify!(ClientIPPort)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcRspUserLoginField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = "\u{f1a35}"]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = "\u{5a3}"]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspUserLoginField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspUserLoginField>(),
        156usize,
        concat!("Size of: ", stringify!(CThostFtdcRspUserLoginField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspUserLoginField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspUserLoginField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).TradingDay as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).LoginTime as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).BrokerID as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).UserID as *const _ as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).SystemName as *const _ as usize
        },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).FrontID as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).SessionID as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).MaxOrderRef as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).SHFETime as *const _ as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).DCETime as *const _ as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).CZCETime as *const _ as usize
        },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).FFEXTime as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLoginField>())).INETime as *const _ as usize
        },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLoginField),
            "::",
            stringify!(INETime)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcUserLogoutField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcUserLogoutField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcUserLogoutField>(),
        27usize,
        concat!("Size of: ", stringify!(CThostFtdcUserLogoutField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcUserLogoutField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcUserLogoutField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserLogoutField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserLogoutField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserLogoutField>())).UserID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserLogoutField),
            "::",
            stringify!(UserID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcForceUserLogoutField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcForceUserLogoutField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcForceUserLogoutField>(),
        27usize,
        concat!("Size of: ", stringify!(CThostFtdcForceUserLogoutField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcForceUserLogoutField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcForceUserLogoutField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcForceUserLogoutField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcForceUserLogoutField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcForceUserLogoutField>())).UserID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcForceUserLogoutField),
            "::",
            stringify!(UserID)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcReqAuthenticateField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = "\u{5a4}"]
    pub AuthCode: TThostFtdcAuthCodeType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcReqAuthenticateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcReqAuthenticateField>(),
        88usize,
        concat!("Size of: ", stringify!(CThostFtdcReqAuthenticateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcReqAuthenticateField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcReqAuthenticateField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqAuthenticateField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqAuthenticateField>())).UserID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqAuthenticateField>())).UserProductInfo as *const _
                as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqAuthenticateField>())).AuthCode as *const _ as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(AuthCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcReqAuthenticateField>())).AppID as *const _ as usize
        },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcReqAuthenticateField),
            "::",
            stringify!(AppID)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcRspAuthenticateField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
    #[doc = "App"]
    pub AppType: TThostFtdcAppTypeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspAuthenticateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspAuthenticateField>(),
        72usize,
        concat!("Size of: ", stringify!(CThostFtdcRspAuthenticateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspAuthenticateField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspAuthenticateField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspAuthenticateField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspAuthenticateField>())).UserID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspAuthenticateField>())).UserProductInfo as *const _
                as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspAuthenticateField>())).AppID as *const _ as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(AppID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspAuthenticateField>())).AppType as *const _ as usize
        },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspAuthenticateField),
            "::",
            stringify!(AppType)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcAuthenticationInfoField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = "\u{5a4}"]
    pub AuthInfo: TThostFtdcAuthInfoType,
    #[doc = "\u{5a4}"]
    pub IsResult: TThostFtdcBoolType,
    #[doc = "App"]
    pub AppID: TThostFtdcAppIDType,
    #[doc = "App"]
    pub AppType: TThostFtdcAppTypeType,
    #[doc = "IP\u{5b7}"]
    pub ClientIPAddress: TThostFtdcIPAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcAuthenticationInfoField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcAuthenticationInfoField>(),
        224usize,
        concat!("Size of: ", stringify!(CThostFtdcAuthenticationInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcAuthenticationInfoField>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcAuthenticationInfoField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).UserID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).UserProductInfo
                as *const _ as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).AuthInfo as *const _
                as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AuthInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).IsResult as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(IsResult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).AppID as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AppID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).AppType as *const _
                as usize
        },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(AppType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcAuthenticationInfoField>())).ClientIPAddress
                as *const _ as usize
        },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcAuthenticationInfoField),
            "::",
            stringify!(ClientIPAddress)
        )
    );
}
#[doc = "2"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcRspUserLogin2Field {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = "\u{f1a35}"]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = "\u{5a3}"]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
    #[doc = ""]
    pub RandomString: TThostFtdcRandomStringType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspUserLogin2Field() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspUserLogin2Field>(),
        172usize,
        concat!("Size of: ", stringify!(CThostFtdcRspUserLogin2Field))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspUserLogin2Field>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspUserLogin2Field))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).TradingDay as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).LoginTime as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).BrokerID as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).UserID as *const _ as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).SystemName as *const _ as usize
        },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).FrontID as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).SessionID as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).MaxOrderRef as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).SHFETime as *const _ as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).DCETime as *const _ as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).CZCETime as *const _ as usize
        },
        127usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).FFEXTime as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).INETime as *const _ as usize
        },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(INETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcRspUserLogin2Field>())).RandomString as *const _
                as usize
        },
        154usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspUserLogin2Field),
            "::",
            stringify!(RandomString)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferHeaderField {
    #[doc = "1.0"]
    pub Version: TThostFtdcVersionType,
    #[doc = ""]
    pub TradeCode: TThostFtdcTradeCodeType,
    #[doc = "\u{e8ec}yyyymmdd"]
    pub TradeDate: TThostFtdcTradeDateType,
    #[doc = "\u{e8ec}hhmmss"]
    pub TradeTime: TThostFtdcTradeTimeType,
    #[doc = "N/A"]
    pub TradeSerial: TThostFtdcTradeSerialType,
    #[doc = ""]
    pub FutureID: TThostFtdcFutureIDType,
    #[doc = ""]
    pub BankID: TThostFtdcBankIDType,
    #[doc = ""]
    pub BankBrchID: TThostFtdcBankBrchIDType,
    #[doc = "N/A"]
    pub OperNo: TThostFtdcOperNoType,
    #[doc = "\u{363}N/A"]
    pub DeviceID: TThostFtdcDeviceIDType,
    #[doc = "N/A"]
    pub RecordNum: TThostFtdcRecordNumType,
    #[doc = "N/A"]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = "N/A"]
    pub RequestID: TThostFtdcRequestIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferHeaderField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferHeaderField>(),
        96usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferHeaderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferHeaderField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTransferHeaderField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).Version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).TradeCode as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).TradeDate as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).TradeTime as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).TradeSerial as *const _
                as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(TradeSerial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).FutureID as *const _ as usize
        },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(FutureID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).BankID as *const _ as usize
        },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(BankID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).BankBrchID as *const _
                as usize
        },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(BankBrchID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).OperNo as *const _ as usize
        },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(OperNo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).DeviceID as *const _ as usize
        },
        75usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(DeviceID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).RecordNum as *const _ as usize
        },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(RecordNum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).SessionID as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferHeaderField>())).RequestID as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferHeaderField),
            "::",
            stringify!(RequestID)
        )
    );
}
#[doc = "TradeCode=202001"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferBankToFutureReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = "\u{5a3}RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferBankToFutureReqField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferBankToFutureReqField>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferBankToFutureReqField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferBankToFutureReqField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferBankToFutureReqField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).FutureAccount
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).FuturePwdFlag
                as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).FutureAccPwd
                as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).TradeAmt as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).CustFee as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureReqField>())).CurrencyCode
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTransferBankToFutureRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferBankToFutureRspField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferBankToFutureRspField>(),
        176usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferBankToFutureRspField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferBankToFutureRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferBankToFutureRspField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).RetCode as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).RetInfo as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).FutureAccount
                as *const _ as usize
        },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).TradeAmt as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).CustFee as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferBankToFutureRspField>())).CurrencyCode
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferBankToFutureRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=202002"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferFutureToBankReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = "\u{5a3}RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferFutureToBankReqField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferFutureToBankReqField>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferFutureToBankReqField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferFutureToBankReqField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferFutureToBankReqField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).FutureAccount
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).FuturePwdFlag
                as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).FutureAccPwd
                as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).TradeAmt as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).CustFee as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankReqField>())).CurrencyCode
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTransferFutureToBankRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CustFee: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferFutureToBankRspField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferFutureToBankRspField>(),
        176usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcTransferFutureToBankRspField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferFutureToBankRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferFutureToBankRspField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).RetCode as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).RetInfo as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).FutureAccount
                as *const _ as usize
        },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).TradeAmt as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).CustFee as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(CustFee)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferFutureToBankRspField>())).CurrencyCode
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferFutureToBankRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=204002"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryBankReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub FuturePwdFlag: TThostFtdcFuturePwdFlagType,
    #[doc = ""]
    pub FutureAccPwd: TThostFtdcFutureAccPwdType,
    #[doc = "\u{5a3}RMB- USD- HKD-"]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryBankReqField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryBankReqField>(),
        35usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryBankReqField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryBankReqField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryBankReqField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankReqField>())).FutureAccount as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankReqField>())).FuturePwdFlag as *const _
                as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FuturePwdFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankReqField>())).FutureAccPwd as *const _
                as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(FutureAccPwd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankReqField>())).CurrencyCode as *const _
                as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankReqField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTransferQryBankRspField {
    #[doc = ""]
    pub RetCode: TThostFtdcRetCodeType,
    #[doc = ""]
    pub RetInfo: TThostFtdcRetInfoType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
    #[doc = ""]
    pub TradeAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub UseAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub FetchAmt: TThostFtdcMoneyType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryBankRspField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryBankRspField>(),
        184usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryBankRspField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryBankRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryBankRspField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).RetCode as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(RetCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).RetInfo as *const _
                as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(RetInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).FutureAccount as *const _
                as usize
        },
        134usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).TradeAmt as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(TradeAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).UseAmt as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(UseAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).FetchAmt as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(FetchAmt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryBankRspField>())).CurrencyCode as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryBankRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
}
#[doc = "TradeCode=204999"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTransferQryDetailReqField {
    #[doc = ""]
    pub FutureAccount: TThostFtdcAccountIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryDetailReqField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryDetailReqField>(),
        13usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryDetailReqField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryDetailReqField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryDetailReqField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailReqField>())).FutureAccount
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailReqField),
            "::",
            stringify!(FutureAccount)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTransferQryDetailRspField {
    #[doc = ""]
    pub TradeDate: TThostFtdcDateType,
    #[doc = ""]
    pub TradeTime: TThostFtdcTradeTimeType,
    #[doc = ""]
    pub TradeCode: TThostFtdcTradeCodeType,
    #[doc = ""]
    pub FutureSerial: TThostFtdcTradeSerialNoType,
    #[doc = ""]
    pub FutureID: TThostFtdcFutureIDType,
    #[doc = ""]
    pub FutureAccount: TThostFtdcFutureAccountType,
    #[doc = ""]
    pub BankSerial: TThostFtdcTradeSerialNoType,
    #[doc = ""]
    pub BankID: TThostFtdcBankIDType,
    #[doc = ""]
    pub BankBrchID: TThostFtdcBankBrchIDType,
    #[doc = ""]
    pub BankAccount: TThostFtdcBankAccountType,
    #[doc = "\u{5a4}"]
    pub CertCode: TThostFtdcCertCodeType,
    #[doc = ""]
    pub CurrencyCode: TThostFtdcCurrencyCodeType,
    #[doc = ""]
    pub TxAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub Flag: TThostFtdcTransferValidFlagType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTransferQryDetailRspField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTransferQryDetailRspField>(),
        168usize,
        concat!("Size of: ", stringify!(CThostFtdcTransferQryDetailRspField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTransferQryDetailRspField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcTransferQryDetailRspField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).TradeDate as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).TradeTime as *const _
                as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).TradeCode as *const _
                as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TradeCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).FutureSerial as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureSerial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).FutureID as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).FutureAccount
                as *const _ as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(FutureAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).BankSerial as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankSerial)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).BankID as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).BankBrchID as *const _
                as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankBrchID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).BankAccount as *const _
                as usize
        },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(BankAccount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).CertCode as *const _
                as usize
        },
        122usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(CertCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).CurrencyCode as *const _
                as usize
        },
        143usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(CurrencyCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).TxAmount as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(TxAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTransferQryDetailRspField>())).Flag as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTransferQryDetailRspField),
            "::",
            stringify!(Flag)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcRspInfoField {
    #[doc = ""]
    pub ErrorID: TThostFtdcErrorIDType,
    #[doc = ""]
    pub ErrorMsg: TThostFtdcErrorMsgType,
}
#[test]
fn bindgen_test_layout_CThostFtdcRspInfoField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcRspInfoField>(),
        88usize,
        concat!("Size of: ", stringify!(CThostFtdcRspInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcRspInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcRspInfoField))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcRspInfoField>())).ErrorID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspInfoField),
            "::",
            stringify!(ErrorID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcRspInfoField>())).ErrorMsg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcRspInfoField),
            "::",
            stringify!(ErrorMsg)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcExchangeField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ExchangeName: TThostFtdcExchangeNameType,
    #[doc = ""]
    pub ExchangeProperty: TThostFtdcExchangePropertyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeField>(),
        71usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeField>())).ExchangeID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeField>())).ExchangeName as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeField>())).ExchangeProperty as *const _
                as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeField),
            "::",
            stringify!(ExchangeProperty)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcProductField {
    #[doc = ""]
    pub ProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ProductName: TThostFtdcProductNameType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ProductClass: TThostFtdcProductClassType,
    #[doc = ""]
    pub VolumeMultiple: TThostFtdcVolumeMultipleType,
    #[doc = ""]
    pub PriceTick: TThostFtdcPriceType,
    #[doc = ""]
    pub MaxMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = "\u{7bc}"]
    pub MaxLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = "\u{7bc}"]
    pub MinLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = "\u{5b2}"]
    pub PositionType: TThostFtdcPositionTypeType,
    #[doc = "\u{5b2}"]
    pub PositionDateType: TThostFtdcPositionDateTypeType,
    #[doc = "\u{5b4}"]
    pub CloseDealType: TThostFtdcCloseDealTypeType,
    #[doc = ""]
    pub TradeCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub MortgageFundUseRange: TThostFtdcMortgageFundUseRangeType,
    #[doc = ""]
    pub ExchangeProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub UnderlyingMultiple: TThostFtdcUnderlyingMultipleType,
}
#[test]
fn bindgen_test_layout_CThostFtdcProductField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcProductField>(),
        144usize,
        concat!("Size of: ", stringify!(CThostFtdcProductField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcProductField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcProductField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).ProductID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).ProductName as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).ExchangeID as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).ProductClass as *const _ as usize
        },
        61usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ProductClass)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).VolumeMultiple as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(VolumeMultiple)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).PriceTick as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PriceTick)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).MaxMarketOrderVolume as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MaxMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).MinMarketOrderVolume as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MinMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).MaxLimitOrderVolume as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MaxLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).MinLimitOrderVolume as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MinLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).PositionType as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PositionType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).PositionDateType as *const _ as usize
        },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(PositionDateType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).CloseDealType as *const _ as usize
        },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(CloseDealType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).TradeCurrencyID as *const _ as usize
        },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(TradeCurrencyID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).MortgageFundUseRange as *const _
                as usize
        },
        103usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(MortgageFundUseRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).ExchangeProductID as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(ExchangeProductID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcProductField>())).UnderlyingMultiple as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcProductField),
            "::",
            stringify!(UnderlyingMultiple)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InstrumentName: TThostFtdcInstrumentNameType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub ProductID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ProductClass: TThostFtdcProductClassType,
    #[doc = ""]
    pub DeliveryYear: TThostFtdcYearType,
    #[doc = ""]
    pub DeliveryMonth: TThostFtdcMonthType,
    #[doc = ""]
    pub MaxMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub MinMarketOrderVolume: TThostFtdcVolumeType,
    #[doc = "\u{7bc}"]
    pub MaxLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = "\u{7bc}"]
    pub MinLimitOrderVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeMultiple: TThostFtdcVolumeMultipleType,
    #[doc = ""]
    pub PriceTick: TThostFtdcPriceType,
    #[doc = ""]
    pub CreateDate: TThostFtdcDateType,
    #[doc = ""]
    pub OpenDate: TThostFtdcDateType,
    #[doc = ""]
    pub ExpireDate: TThostFtdcDateType,
    #[doc = ""]
    pub StartDelivDate: TThostFtdcDateType,
    #[doc = ""]
    pub EndDelivDate: TThostFtdcDateType,
    #[doc = "\u{32c}"]
    pub InstLifePhase: TThostFtdcInstLifePhaseType,
    #[doc = ""]
    pub IsTrading: TThostFtdcBoolType,
    #[doc = "\u{5b2}"]
    pub PositionType: TThostFtdcPositionTypeType,
    #[doc = "\u{5b2}"]
    pub PositionDateType: TThostFtdcPositionDateTypeType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatio: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatio: TThostFtdcRatioType,
    #[doc = "\u{ed65}\u{7f1}\u{5a4}"]
    pub MaxMarginSideAlgorithm: TThostFtdcMaxMarginSideAlgorithmType,
    #[doc = ""]
    pub UnderlyingInstrID: TThostFtdcInstrumentIDType,
    #[doc = "\u{5b4}"]
    pub StrikePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub OptionsType: TThostFtdcOptionsTypeType,
    #[doc = ""]
    pub UnderlyingMultiple: TThostFtdcUnderlyingMultipleType,
    #[doc = ""]
    pub CombinationType: TThostFtdcCombinationTypeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentField>(),
        296usize,
        concat!("Size of: ", stringify!(CThostFtdcInstrumentField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInstrumentField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).InstrumentID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ExchangeID as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).InstrumentName as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstrumentName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ExchangeInstID as *const _
                as usize
        },
        61usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ProductID as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ProductID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ProductClass as *const _ as usize
        },
        123usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ProductClass)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).DeliveryYear as *const _ as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(DeliveryYear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).DeliveryMonth as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(DeliveryMonth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).MaxMarketOrderVolume as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).MinMarketOrderVolume as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MinMarketOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).MaxLimitOrderVolume as *const _
                as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).MinLimitOrderVolume as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MinLimitOrderVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).VolumeMultiple as *const _
                as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(VolumeMultiple)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).PriceTick as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PriceTick)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).CreateDate as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(CreateDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).OpenDate as *const _ as usize
        },
        169usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(OpenDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ExpireDate as *const _ as usize
        },
        178usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ExpireDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).StartDelivDate as *const _
                as usize
        },
        187usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(StartDelivDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).EndDelivDate as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(EndDelivDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).InstLifePhase as *const _ as usize
        },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(InstLifePhase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).IsTrading as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(IsTrading)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).PositionType as *const _ as usize
        },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PositionType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).PositionDateType as *const _
                as usize
        },
        213usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(PositionDateType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).LongMarginRatio as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(LongMarginRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).ShortMarginRatio as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(ShortMarginRatio)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).MaxMarginSideAlgorithm as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(MaxMarginSideAlgorithm)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).UnderlyingInstrID as *const _
                as usize
        },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(UnderlyingInstrID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).StrikePrice as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(StrikePrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).OptionsType as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(OptionsType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).UnderlyingMultiple as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(UnderlyingMultiple)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentField>())).CombinationType as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentField),
            "::",
            stringify!(CombinationType)
        )
    );
}
#[doc = "\u{379}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcBrokerField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = "\u{379}"]
    pub BrokerAbbr: TThostFtdcBrokerAbbrType,
    #[doc = "\u{379}"]
    pub BrokerName: TThostFtdcBrokerNameType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerField>(),
        108usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcBrokerField))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcBrokerField>())).BrokerID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerField>())).BrokerAbbr as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerAbbr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerField>())).BrokerName as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(BrokerName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcBrokerField>())).IsActive as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTraderField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub InstallCount: TThostFtdcInstallCountType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTraderField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTraderField>(),
        100usize,
        concat!("Size of: ", stringify!(CThostFtdcTraderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTraderField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTraderField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderField>())).ExchangeID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcTraderField>())).TraderID as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderField>())).ParticipantID as *const _ as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcTraderField>())).Password as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderField>())).InstallCount as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(InstallCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcTraderField>())).BrokerID as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderField),
            "::",
            stringify!(BrokerID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcInvestorField {
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorGroupID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InvestorName: TThostFtdcPartyNameType,
    #[doc = "\u{5a4}"]
    pub IdentifiedCardType: TThostFtdcIdCardTypeType,
    #[doc = "\u{5a4}"]
    pub IdentifiedCardNo: TThostFtdcIdentifiedCardNoType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub Telephone: TThostFtdcTelephoneType,
    #[doc = "\u{368}\u{5b7}"]
    pub Address: TThostFtdcAddressType,
    #[doc = ""]
    pub OpenDate: TThostFtdcDateType,
    #[doc = "\u{5bb}"]
    pub Mobile: TThostFtdcMobileType,
    #[doc = ""]
    pub CommModelID: TThostFtdcInvestorIDType,
    #[doc = "\u{5a4}"]
    pub MarginModelID: TThostFtdcInvestorIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorField>(),
        396usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).InvestorID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).BrokerID as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).InvestorGroupID as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorGroupID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).InvestorName as *const _ as usize
        },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(InvestorName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).IdentifiedCardType as *const _
                as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IdentifiedCardType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).IdentifiedCardNo as *const _
                as usize
        },
        119usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IdentifiedCardNo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).IsActive as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).Telephone as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Telephone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcInvestorField>())).Address as *const _ as usize },
        217usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).OpenDate as *const _ as usize
        },
        318usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(OpenDate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcInvestorField>())).Mobile as *const _ as usize },
        327usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(Mobile)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).CommModelID as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(CommModelID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorField>())).MarginModelID as *const _ as usize
        },
        381usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorField),
            "::",
            stringify!(MarginModelID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTradingCodeField {
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub ClientIDType: TThostFtdcClientIDTypeType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTradingCodeField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTradingCodeField>(),
        76usize,
        concat!("Size of: ", stringify!(CThostFtdcTradingCodeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTradingCodeField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTradingCodeField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).InvestorID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).BrokerID as *const _ as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).ExchangeID as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).ClientID as *const _ as usize
        },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).IsActive as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).ClientIDType as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(ClientIDType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).BranchID as *const _ as usize
        },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BranchID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).BizType as *const _ as usize
        },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingCodeField>())).InvestUnitID as *const _ as usize
        },
        59usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingCodeField),
            "::",
            stringify!(InvestUnitID)
        )
    );
}
#[doc = "\u{379}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcPartBrokerField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcPartBrokerField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcPartBrokerField>(),
        36usize,
        concat!("Size of: ", stringify!(CThostFtdcPartBrokerField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcPartBrokerField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcPartBrokerField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcPartBrokerField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcPartBrokerField>())).ExchangeID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcPartBrokerField>())).ParticipantID as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcPartBrokerField>())).IsActive as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcPartBrokerField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcSuperUserField {
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserName: TThostFtdcUserNameType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSuperUserField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSuperUserField>(),
        144usize,
        concat!("Size of: ", stringify!(CThostFtdcSuperUserField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSuperUserField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSuperUserField))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcSuperUserField>())).UserID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSuperUserField>())).UserName as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(UserName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSuperUserField>())).Password as *const _ as usize
        },
        97usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSuperUserField>())).IsActive as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSuperUserFunctionField {
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = "\u{734}"]
    pub FunctionCode: TThostFtdcFunctionCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSuperUserFunctionField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSuperUserFunctionField>(),
        17usize,
        concat!("Size of: ", stringify!(CThostFtdcSuperUserFunctionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSuperUserFunctionField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcSuperUserFunctionField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSuperUserFunctionField>())).UserID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserFunctionField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSuperUserFunctionField>())).FunctionCode as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSuperUserFunctionField),
            "::",
            stringify!(FunctionCode)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcInvestorGroupField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorGroupID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InvestorGroupName: TThostFtdcInvestorGroupNameType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorGroupField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorGroupField>(),
        65usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorGroupField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorGroupField>(),
        1usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorGroupField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorGroupField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorGroupField>())).InvestorGroupID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(InvestorGroupID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorGroupField>())).InvestorGroupName as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorGroupField),
            "::",
            stringify!(InvestorGroupName)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcTradingAccountField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = ""]
    pub PreMortgage: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreCredit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreDeposit: TThostFtdcMoneyType,
    #[doc = "\u{5fc}"]
    pub PreBalance: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub PreMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub InterestBase: TThostFtdcMoneyType,
    #[doc = ""]
    pub Interest: TThostFtdcMoneyType,
    #[doc = ""]
    pub Deposit: TThostFtdcMoneyType,
    #[doc = ""]
    pub Withdraw: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub FrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCash: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCommission: TThostFtdcMoneyType,
    #[doc = "\u{5a4}\u{736}"]
    pub CurrMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub CashIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub Commission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfit: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub PositionProfit: TThostFtdcMoneyType,
    #[doc = "\u{5fc}"]
    pub Balance: TThostFtdcMoneyType,
    #[doc = ""]
    pub Available: TThostFtdcMoneyType,
    #[doc = ""]
    pub WithdrawQuota: TThostFtdcMoneyType,
    #[doc = "\u{5fc}"]
    pub Reserve: TThostFtdcMoneyType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub Credit: TThostFtdcMoneyType,
    #[doc = ""]
    pub Mortgage: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ExchangeMargin: TThostFtdcMoneyType,
    #[doc = "\u{7fd}\u{ec63}\u{5a4}"]
    pub DeliveryMargin: TThostFtdcMoneyType,
    #[doc = "\u{ec63}\u{5a4}"]
    pub ExchangeDeliveryMargin: TThostFtdcMoneyType,
    #[doc = "\u{5fc}"]
    pub ReserveBalance: TThostFtdcMoneyType,
    #[doc = "\u{5b4}"]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub PreFundMortgageIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreFundMortgageOut: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageOut: TThostFtdcMoneyType,
    #[doc = ""]
    pub FundMortgageAvailable: TThostFtdcMoneyType,
    #[doc = ""]
    pub MortgageableFund: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub SpecProductMargin: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub SpecProductFrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductFrozenCommission: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub SpecProductPositionProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub SpecProductCloseProfit: TThostFtdcMoneyType,
    #[doc = "\u{5b2}\u{5b2}"]
    pub SpecProductPositionProfitByAlg: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub SpecProductExchangeMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub FrozenSwap: TThostFtdcMoneyType,
    #[doc = "\u{efb}"]
    pub RemainSwap: TThostFtdcMoneyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTradingAccountField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTradingAccountField>(),
        400usize,
        concat!("Size of: ", stringify!(CThostFtdcTradingAccountField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTradingAccountField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcTradingAccountField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).AccountID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreMortgage as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreMortgage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreCredit as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreCredit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreDeposit as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreDeposit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreBalance as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreBalance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreMargin as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).InterestBase as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(InterestBase)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Interest as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Interest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Deposit as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Deposit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Withdraw as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Withdraw)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FrozenMargin as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FrozenCash as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenCash)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FrozenCommission as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenCommission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).CurrMargin as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CurrMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).CashIn as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CashIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Commission as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Commission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).CloseProfit as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CloseProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PositionProfit as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PositionProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Balance as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Balance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Available as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Available)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).WithdrawQuota as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(WithdrawQuota)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Reserve as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Reserve)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).TradingDay as *const _
                as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SettlementID as *const _
                as usize
        },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Credit as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Credit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).Mortgage as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(Mortgage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).ExchangeMargin as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ExchangeMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).DeliveryMargin as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(DeliveryMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).ExchangeDeliveryMargin
                as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ExchangeDeliveryMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).ReserveBalance as *const _
                as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(ReserveBalance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).CurrencyID as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreFundMortgageIn as *const _
                as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreFundMortgageIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).PreFundMortgageOut as *const _
                as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(PreFundMortgageOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FundMortgageIn as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FundMortgageOut as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageOut)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FundMortgageAvailable
                as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FundMortgageAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).MortgageableFund as *const _
                as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(MortgageableFund)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductMargin as *const _
                as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductFrozenMargin
                as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductFrozenMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductCommission
                as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductCommission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductFrozenCommission
                as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductFrozenCommission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductPositionProfit
                as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductPositionProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductCloseProfit
                as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductCloseProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductPositionProfitByAlg
                as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductPositionProfitByAlg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).SpecProductExchangeMargin
                as *const _ as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(SpecProductExchangeMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).BizType as *const _ as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).FrozenSwap as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(FrozenSwap)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTradingAccountField>())).RemainSwap as *const _
                as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTradingAccountField),
            "::",
            stringify!(RemainSwap)
        )
    );
}
#[doc = "\u{7f3}\u{5b2}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInvestorPositionField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = "\u{5b2}\u{5b6}"]
    pub PosiDirection: TThostFtdcPosiDirectionType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = "\u{5b2}"]
    pub PositionDate: TThostFtdcPositionDateType,
    #[doc = "\u{5b2}"]
    pub YdPosition: TThostFtdcVolumeType,
    #[doc = "\u{5b2}"]
    pub Position: TThostFtdcVolumeType,
    #[doc = ""]
    pub LongFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub ShortFrozen: TThostFtdcVolumeType,
    #[doc = "\u{5b6}"]
    pub LongFrozenAmount: TThostFtdcMoneyType,
    #[doc = "\u{5b6}"]
    pub ShortFrozenAmount: TThostFtdcMoneyType,
    #[doc = ""]
    pub OpenVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub CloseVolume: TThostFtdcVolumeType,
    #[doc = "\u{5bd}"]
    pub OpenAmount: TThostFtdcMoneyType,
    #[doc = "\u{5bd}"]
    pub CloseAmount: TThostFtdcMoneyType,
    #[doc = "\u{5b2}\u{5b3}"]
    pub PositionCost: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub PreMargin: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub UseMargin: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub FrozenMargin: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCash: TThostFtdcMoneyType,
    #[doc = ""]
    pub FrozenCommission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CashIn: TThostFtdcMoneyType,
    #[doc = ""]
    pub Commission: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfit: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub PositionProfit: TThostFtdcMoneyType,
    #[doc = ""]
    pub PreSettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub SettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = "\u{5b3}"]
    pub OpenCost: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ExchangeMargin: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub CombPosition: TThostFtdcVolumeType,
    #[doc = ""]
    pub CombLongFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub CombShortFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub CloseProfitByDate: TThostFtdcMoneyType,
    #[doc = ""]
    pub CloseProfitByTrade: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub TodayPosition: TThostFtdcVolumeType,
    #[doc = "\u{5a4}"]
    pub MarginRateByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}()"]
    pub MarginRateByVolume: TThostFtdcRatioType,
    #[doc = "\u{5b4}"]
    pub StrikeFrozen: TThostFtdcVolumeType,
    #[doc = "\u{5b4}"]
    pub StrikeFrozenAmount: TThostFtdcMoneyType,
    #[doc = "\u{5b4}"]
    pub AbandonFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = "\u{5b4}"]
    pub YdStrikeFrozen: TThostFtdcVolumeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = "\u{5b2}\u{5b3}\u{5b5}\u{5bb}"]
    pub PositionCostOffset: TThostFtdcMoneyType,
    #[doc = "tas\u{5b2}"]
    pub TasPosition: TThostFtdcVolumeType,
    #[doc = "tas\u{5b2}\u{5b3}"]
    pub TasPositionCost: TThostFtdcMoneyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInvestorPositionField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInvestorPositionField>(),
        384usize,
        concat!("Size of: ", stringify!(CThostFtdcInvestorPositionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInvestorPositionField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInvestorPositionField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).InstrumentID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).BrokerID as *const _
                as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).InvestorID as *const _
                as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PosiDirection as *const _
                as usize
        },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PosiDirection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).HedgeFlag as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PositionDate as *const _
                as usize
        },
        57usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).YdPosition as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(YdPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).Position as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(Position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).LongFrozen as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(LongFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).ShortFrozen as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ShortFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).LongFrozenAmount as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(LongFrozenAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).ShortFrozenAmount
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ShortFrozenAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).OpenVolume as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CloseVolume as *const _
                as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).OpenAmount as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CloseAmount as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PositionCost as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionCost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PreMargin as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PreMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).UseMargin as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(UseMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).FrozenMargin as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).FrozenCash as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenCash)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).FrozenCommission as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(FrozenCommission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CashIn as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CashIn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).Commission as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(Commission)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CloseProfit as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PositionProfit as *const _
                as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionProfit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PreSettlementPrice
                as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PreSettlementPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).SettlementPrice as *const _
                as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(SettlementPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).TradingDay as *const _
                as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).SettlementID as *const _
                as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).OpenCost as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(OpenCost)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).ExchangeMargin as *const _
                as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ExchangeMargin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CombPosition as *const _
                as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CombLongFrozen as *const _
                as usize
        },
        252usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombLongFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CombShortFrozen as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CombShortFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CloseProfitByDate
                as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfitByDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).CloseProfitByTrade
                as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(CloseProfitByTrade)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).TodayPosition as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TodayPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).MarginRateByMoney
                as *const _ as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(MarginRateByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).MarginRateByVolume
                as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(MarginRateByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).StrikeFrozen as *const _
                as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(StrikeFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).StrikeFrozenAmount
                as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(StrikeFrozenAmount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).AbandonFrozen as *const _
                as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(AbandonFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).ExchangeID as *const _
                as usize
        },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).YdStrikeFrozen as *const _
                as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(YdStrikeFrozen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).InvestUnitID as *const _
                as usize
        },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).PositionCostOffset
                as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(PositionCostOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).TasPosition as *const _
                as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TasPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInvestorPositionField>())).TasPositionCost as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInvestorPositionField),
            "::",
            stringify!(TasPositionCost)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentMarginRateField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub IsRelative: TThostFtdcBoolType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentMarginRateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentMarginRateField>(),
        128usize,
        concat!("Size of: ", stringify!(CThostFtdcInstrumentMarginRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentMarginRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentMarginRateField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).InstrumentID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).InvestorRange
                as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).BrokerID as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).InvestorID as *const _
                as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).HedgeFlag as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).LongMarginRatioByMoney
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).LongMarginRatioByVolume
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).ShortMarginRatioByMoney
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).ShortMarginRatioByVolume
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).IsRelative as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(IsRelative)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).ExchangeID as *const _
                as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateField>())).InvestUnitID as *const _
                as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateField),
            "::",
            stringify!(InvestUnitID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentCommissionRateField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub OpenRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub OpenRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseTodayRatioByMoney: TThostFtdcRatioType,
    #[doc = ""]
    pub CloseTodayRatioByVolume: TThostFtdcRatioType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub BizType: TThostFtdcBizTypeType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentCommissionRateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentCommissionRateField>(),
        136usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentCommissionRateField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentCommissionRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentCommissionRateField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).InstrumentID
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).InvestorRange
                as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).BrokerID as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).InvestorID
                as *const _ as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).OpenRatioByMoney
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(OpenRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).OpenRatioByVolume
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(OpenRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).CloseRatioByMoney
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).CloseRatioByVolume
                as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>()))
                .CloseTodayRatioByMoney as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseTodayRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>()))
                .CloseTodayRatioByVolume as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(CloseTodayRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).ExchangeID
                as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).BizType as *const _
                as usize
        },
        113usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(BizType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentCommissionRateField>())).InvestUnitID
                as *const _ as usize
        },
        114usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentCommissionRateField),
            "::",
            stringify!(InvestUnitID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcDepthMarketDataField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub LastPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreSettlementPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreClosePrice: TThostFtdcPriceType,
    #[doc = "\u{5b2}"]
    pub PreOpenInterest: TThostFtdcLargeVolumeType,
    #[doc = ""]
    pub OpenPrice: TThostFtdcPriceType,
    #[doc = "\u{7fc}"]
    pub HighestPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub LowestPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub Volume: TThostFtdcVolumeType,
    #[doc = ""]
    pub Turnover: TThostFtdcMoneyType,
    #[doc = "\u{5b2}"]
    pub OpenInterest: TThostFtdcLargeVolumeType,
    #[doc = ""]
    pub ClosePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub SettlementPrice: TThostFtdcPriceType,
    #[doc = "\u{363}"]
    pub UpperLimitPrice: TThostFtdcPriceType,
    #[doc = "\u{363}"]
    pub LowerLimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub PreDelta: TThostFtdcRatioType,
    #[doc = ""]
    pub CurrDelta: TThostFtdcRatioType,
    #[doc = "\u{7b8}"]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = "\u{7b8}"]
    pub UpdateMillisec: TThostFtdcMillisecType,
    #[doc = ""]
    pub BidPrice1: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume1: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice1: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume1: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice2: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume2: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice2: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume2: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice3: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume3: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice3: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume3: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice4: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume4: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice4: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume4: TThostFtdcVolumeType,
    #[doc = ""]
    pub BidPrice5: TThostFtdcPriceType,
    #[doc = ""]
    pub BidVolume5: TThostFtdcVolumeType,
    #[doc = ""]
    pub AskPrice5: TThostFtdcPriceType,
    #[doc = ""]
    pub AskVolume5: TThostFtdcVolumeType,
    #[doc = ""]
    pub AveragePrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ActionDay: TThostFtdcDateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcDepthMarketDataField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcDepthMarketDataField>(),
        408usize,
        concat!("Size of: ", stringify!(CThostFtdcDepthMarketDataField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcDepthMarketDataField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcDepthMarketDataField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).TradingDay as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).InstrumentID as *const _
                as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).ExchangeID as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).ExchangeInstID as *const _
                as usize
        },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).LastPrice as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LastPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).PreSettlementPrice
                as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreSettlementPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).PreClosePrice as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreClosePrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).PreOpenInterest as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreOpenInterest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).OpenPrice as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(OpenPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).HighestPrice as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(HighestPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).LowestPrice as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LowestPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).Volume as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(Volume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).Turnover as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(Turnover)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).OpenInterest as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(OpenInterest)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).ClosePrice as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ClosePrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).SettlementPrice as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(SettlementPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).UpperLimitPrice as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpperLimitPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).LowerLimitPrice as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(LowerLimitPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).PreDelta as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(PreDelta)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).CurrDelta as *const _
                as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(CurrDelta)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).UpdateTime as *const _
                as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpdateTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).UpdateMillisec as *const _
                as usize
        },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(UpdateMillisec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidPrice1 as *const _
                as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidVolume1 as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskPrice1 as *const _
                as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskVolume1 as *const _
                as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidPrice2 as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidVolume2 as *const _
                as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskPrice2 as *const _
                as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskVolume2 as *const _
                as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidPrice3 as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidVolume3 as *const _
                as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskPrice3 as *const _
                as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskVolume3 as *const _
                as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidPrice4 as *const _
                as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidVolume4 as *const _
                as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskPrice4 as *const _
                as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskVolume4 as *const _
                as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidPrice5 as *const _
                as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidPrice5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).BidVolume5 as *const _
                as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(BidVolume5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskPrice5 as *const _
                as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskPrice5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AskVolume5 as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AskVolume5)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).AveragePrice as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(AveragePrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcDepthMarketDataField>())).ActionDay as *const _
                as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcDepthMarketDataField),
            "::",
            stringify!(ActionDay)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentTradingRightField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub TradingRight: TThostFtdcTradingRightType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentTradingRightField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentTradingRightField>(),
        57usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentTradingRightField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentTradingRightField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentTradingRightField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentTradingRightField>())).InstrumentID
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentTradingRightField>())).InvestorRange
                as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentTradingRightField>())).BrokerID as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentTradingRightField>())).InvestorID as *const _
                as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentTradingRightField>())).TradingRight
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentTradingRightField),
            "::",
            stringify!(TradingRight)
        )
    );
}
#[doc = "\u{379}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcBrokerUserField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub UserName: TThostFtdcUserNameType,
    #[doc = ""]
    pub UserType: TThostFtdcUserTypeType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
    #[doc = ""]
    pub IsUsingOTP: TThostFtdcBoolType,
    #[doc = "\u{5a4}"]
    pub IsAuthForce: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserField>(),
        124usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcBrokerUserField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).UserID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).UserName as *const _ as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).UserType as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(UserType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).IsActive as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsActive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).IsUsingOTP as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsUsingOTP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserField>())).IsAuthForce as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserField),
            "::",
            stringify!(IsAuthForce)
        )
    );
}
#[doc = "\u{379}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcBrokerUserPasswordField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = "\u{7b8}"]
    pub LastUpdateTime: TThostFtdcDateTimeType,
    #[doc = ""]
    pub LastLoginTime: TThostFtdcDateTimeType,
    #[doc = ""]
    pub ExpireDate: TThostFtdcDateType,
    #[doc = ""]
    pub WeakExpireDate: TThostFtdcDateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserPasswordField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserPasswordField>(),
        120usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserPasswordField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserPasswordField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcBrokerUserPasswordField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).UserID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).Password as *const _
                as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).LastUpdateTime as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(LastUpdateTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).LastLoginTime as *const _
                as usize
        },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(LastLoginTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).ExpireDate as *const _
                as usize
        },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(ExpireDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserPasswordField>())).WeakExpireDate as *const _
                as usize
        },
        111usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserPasswordField),
            "::",
            stringify!(WeakExpireDate)
        )
    );
}
#[doc = "\u{379}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcBrokerUserFunctionField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = "\u{379}\u{734}"]
    pub BrokerFunctionCode: TThostFtdcBrokerFunctionCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcBrokerUserFunctionField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcBrokerUserFunctionField>(),
        28usize,
        concat!("Size of: ", stringify!(CThostFtdcBrokerUserFunctionField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcBrokerUserFunctionField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcBrokerUserFunctionField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserFunctionField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserFunctionField>())).UserID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcBrokerUserFunctionField>())).BrokerFunctionCode
                as *const _ as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcBrokerUserFunctionField),
            "::",
            stringify!(BrokerFunctionCode)
        )
    );
}
#[doc = "\u{33b}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcTraderOfferField {
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = "\u{32c}"]
    pub TraderConnectStatus: TThostFtdcTraderConnectStatusType,
    #[doc = ""]
    pub ConnectRequestDate: TThostFtdcDateType,
    #[doc = ""]
    pub ConnectRequestTime: TThostFtdcTimeType,
    #[doc = ""]
    pub LastReportDate: TThostFtdcDateType,
    #[doc = ""]
    pub LastReportTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ConnectDate: TThostFtdcDateType,
    #[doc = ""]
    pub ConnectTime: TThostFtdcTimeType,
    #[doc = ""]
    pub StartDate: TThostFtdcDateType,
    #[doc = ""]
    pub StartTime: TThostFtdcTimeType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub MaxTradeID: TThostFtdcTradeIDType,
    #[doc = "\u{f1a35}"]
    pub MaxOrderMessageReference: TThostFtdcReturnCodeType,
}
#[test]
fn bindgen_test_layout_CThostFtdcTraderOfferField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcTraderOfferField>(),
        224usize,
        concat!("Size of: ", stringify!(CThostFtdcTraderOfferField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcTraderOfferField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcTraderOfferField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ExchangeID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).TraderID as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ParticipantID as *const _
                as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).Password as *const _ as usize
        },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(Password)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).InstallID as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(InstallID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).OrderLocalID as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(OrderLocalID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).TraderConnectStatus as *const _
                as usize
        },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TraderConnectStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ConnectRequestDate as *const _
                as usize
        },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectRequestDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ConnectRequestTime as *const _
                as usize
        },
        111usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectRequestTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).LastReportDate as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(LastReportDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).LastReportTime as *const _
                as usize
        },
        129usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(LastReportTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ConnectDate as *const _ as usize
        },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).ConnectTime as *const _ as usize
        },
        147usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(ConnectTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).StartDate as *const _ as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(StartDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).StartTime as *const _ as usize
        },
        165usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(StartTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).TradingDay as *const _ as usize
        },
        174usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).BrokerID as *const _ as usize
        },
        183usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).MaxTradeID as *const _ as usize
        },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(MaxTradeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcTraderOfferField>())).MaxOrderMessageReference
                as *const _ as usize
        },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcTraderOfferField),
            "::",
            stringify!(MaxOrderMessageReference)
        )
    );
}
#[doc = "\u{7fd}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcSettlementInfoField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub Content: TThostFtdcContentType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = "\u{5b4}"]
    pub CurrencyID: TThostFtdcCurrencyIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSettlementInfoField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSettlementInfoField>(),
        564usize,
        concat!("Size of: ", stringify!(CThostFtdcSettlementInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSettlementInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSettlementInfoField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).TradingDay as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).SettlementID as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).BrokerID as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).InvestorID as *const _
                as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).SequenceNo as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(SequenceNo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).Content as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(Content)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).AccountID as *const _ as usize
        },
        545usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementInfoField>())).CurrencyID as *const _
                as usize
        },
        558usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementInfoField),
            "::",
            stringify!(CurrencyID)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInstrumentMarginRateAdjustField {
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub InvestorRange: TThostFtdcInvestorRangeType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub IsRelative: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInstrumentMarginRateAdjustField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInstrumentMarginRateAdjustField>(),
        104usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInstrumentMarginRateAdjustField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).InstrumentID
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).InvestorRange
                as *const _ as usize
        },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InvestorRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).BrokerID
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).InvestorID
                as *const _ as usize
        },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).HedgeFlag
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>()))
                .LongMarginRatioByMoney as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>()))
                .LongMarginRatioByVolume as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>()))
                .ShortMarginRatioByMoney as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>()))
                .ShortMarginRatioByVolume as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInstrumentMarginRateAdjustField>())).IsRelative
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInstrumentMarginRateAdjustField),
            "::",
            stringify!(IsRelative)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeMarginRateField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeMarginRateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeMarginRateField>(),
        96usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeMarginRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeMarginRateField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcExchangeMarginRateField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).InstrumentID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).HedgeFlag as *const _
                as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).LongMarginRatioByMoney
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).LongMarginRatioByVolume
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).ShortMarginRatioByMoney
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).ShortMarginRatioByVolume
                as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateField>())).ExchangeID as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateField),
            "::",
            stringify!(ExchangeID)
        )
    );
}
#[doc = "\u{5a4}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeMarginRateAdjustField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub HedgeFlag: TThostFtdcHedgeFlagType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub LongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ExchLongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ExchLongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub ExchShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub ExchShortMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub NoLongMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub NoLongMarginRatioByVolume: TThostFtdcMoneyType,
    #[doc = "\u{5a4}"]
    pub NoShortMarginRatioByMoney: TThostFtdcRatioType,
    #[doc = "\u{5a4}"]
    pub NoShortMarginRatioByVolume: TThostFtdcMoneyType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeMarginRateAdjustField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeMarginRateAdjustField>(),
        144usize,
        concat!(
            "Size of: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeMarginRateAdjustField>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>())).InstrumentID
                as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>())).HedgeFlag
                as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(HedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .LongMarginRatioByMoney as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .LongMarginRatioByVolume as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(LongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ShortMarginRatioByMoney as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ShortMarginRatioByVolume as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ExchLongMarginRatioByMoney as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchLongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ExchLongMarginRatioByVolume as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchLongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ExchShortMarginRatioByMoney as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .ExchShortMarginRatioByVolume as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(ExchShortMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .NoLongMarginRatioByMoney as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoLongMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .NoLongMarginRatioByVolume as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoLongMarginRatioByVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .NoShortMarginRatioByMoney as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoShortMarginRatioByMoney)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeMarginRateAdjustField>()))
                .NoShortMarginRatioByVolume as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeMarginRateAdjustField),
            "::",
            stringify!(NoShortMarginRatioByVolume)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeRateField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub FromCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = "\u{5b5}"]
    pub FromCurrencyUnit: TThostFtdcCurrencyUnitType,
    #[doc = ""]
    pub ToCurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub ExchangeRate: TThostFtdcExchangeRateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeRateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeRateField>(),
        40usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeRateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeRateField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeRateField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeRateField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeRateField>())).FromCurrencyID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(FromCurrencyID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeRateField>())).FromCurrencyUnit as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(FromCurrencyUnit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeRateField>())).ToCurrencyID as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(ToCurrencyID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeRateField>())).ExchangeRate as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeRateField),
            "::",
            stringify!(ExchangeRate)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcSettlementRefField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcSettlementRefField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcSettlementRefField>(),
        16usize,
        concat!("Size of: ", stringify!(CThostFtdcSettlementRefField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcSettlementRefField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcSettlementRefField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementRefField>())).TradingDay as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementRefField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcSettlementRefField>())).SettlementID as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcSettlementRefField),
            "::",
            stringify!(SettlementID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcCurrentTimeField {
    #[doc = ""]
    pub CurrDate: TThostFtdcDateType,
    #[doc = ""]
    pub CurrTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CurrMillisec: TThostFtdcMillisecType,
    #[doc = ""]
    pub ActionDay: TThostFtdcDateType,
}
#[test]
fn bindgen_test_layout_CThostFtdcCurrentTimeField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcCurrentTimeField>(),
        36usize,
        concat!("Size of: ", stringify!(CThostFtdcCurrentTimeField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcCurrentTimeField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcCurrentTimeField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCurrentTimeField>())).CurrDate as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCurrentTimeField>())).CurrTime as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCurrentTimeField>())).CurrMillisec as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(CurrMillisec)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCurrentTimeField>())).ActionDay as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCurrentTimeField),
            "::",
            stringify!(ActionDay)
        )
    );
}
#[doc = "\u{368}\u{5f6}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcCommPhaseField {
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = "\u{368}"]
    pub CommPhaseNo: TThostFtdcCommPhaseNoType,
    #[doc = ""]
    pub SystemID: TThostFtdcSystemIDType,
}
#[test]
fn bindgen_test_layout_CThostFtdcCommPhaseField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcCommPhaseField>(),
        34usize,
        concat!("Size of: ", stringify!(CThostFtdcCommPhaseField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcCommPhaseField>(),
        2usize,
        concat!("Alignment of ", stringify!(CThostFtdcCommPhaseField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCommPhaseField>())).TradingDay as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCommPhaseField>())).CommPhaseNo as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(CommPhaseNo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcCommPhaseField>())).SystemID as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcCommPhaseField),
            "::",
            stringify!(SystemID)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcLoginInfoField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub LoginDate: TThostFtdcDateType,
    #[doc = ""]
    pub LoginTime: TThostFtdcTimeType,
    #[doc = "IP\u{5b7}"]
    pub IPAddress: TThostFtdcIPAddressType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub InterfaceProductInfo: TThostFtdcProductInfoType,
    #[doc = ""]
    pub ProtocolInfo: TThostFtdcProtocolInfoType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
    #[doc = ","]
    pub PasswordDeprecated: TThostFtdcPasswordType,
    #[doc = "\u{f1a35}"]
    pub MaxOrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub SHFETime: TThostFtdcTimeType,
    #[doc = ""]
    pub DCETime: TThostFtdcTimeType,
    #[doc = "\u{5a3}"]
    pub CZCETime: TThostFtdcTimeType,
    #[doc = ""]
    pub FFEXTime: TThostFtdcTimeType,
    #[doc = "Mac\u{5b7}"]
    pub MacAddress: TThostFtdcMacAddressType,
    #[doc = "\u{32c}"]
    pub OneTimePassword: TThostFtdcPasswordType,
    #[doc = ""]
    pub INETime: TThostFtdcTimeType,
    #[doc = ""]
    pub IsQryControl: TThostFtdcBoolType,
    #[doc = ""]
    pub LoginRemark: TThostFtdcLoginRemarkType,
    #[doc = ""]
    pub Password: TThostFtdcPasswordType,
}
#[test]
fn bindgen_test_layout_CThostFtdcLoginInfoField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcLoginInfoField>(),
        388usize,
        concat!("Size of: ", stringify!(CThostFtdcLoginInfoField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcLoginInfoField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcLoginInfoField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).FrontID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).SessionID as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).BrokerID as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).UserID as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).LoginDate as *const _ as usize
        },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).LoginTime as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).IPAddress as *const _ as usize
        },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(IPAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).UserProductInfo as *const _
                as usize
        },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).InterfaceProductInfo as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(InterfaceProductInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).ProtocolInfo as *const _ as usize
        },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(ProtocolInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).SystemName as *const _ as usize
        },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SystemName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).PasswordDeprecated as *const _
                as usize
        },
        143usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(PasswordDeprecated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).MaxOrderRef as *const _ as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(MaxOrderRef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).SHFETime as *const _ as usize
        },
        197usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(SHFETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).DCETime as *const _ as usize
        },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(DCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).CZCETime as *const _ as usize
        },
        215usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(CZCETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).FFEXTime as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(FFEXTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).MacAddress as *const _ as usize
        },
        233usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(MacAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).OneTimePassword as *const _
                as usize
        },
        254usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(OneTimePassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).INETime as *const _ as usize
        },
        295usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(INETime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).IsQryControl as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(IsQryControl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).LoginRemark as *const _ as usize
        },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(LoginRemark)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLoginInfoField>())).Password as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLoginInfoField),
            "::",
            stringify!(Password)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcLogoutAllField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub SystemName: TThostFtdcSystemNameType,
}
#[test]
fn bindgen_test_layout_CThostFtdcLogoutAllField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcLogoutAllField>(),
        52usize,
        concat!("Size of: ", stringify!(CThostFtdcLogoutAllField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcLogoutAllField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcLogoutAllField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLogoutAllField>())).FrontID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLogoutAllField>())).SessionID as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcLogoutAllField>())).SystemName as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcLogoutAllField),
            "::",
            stringify!(SystemName)
        )
    );
}
#[doc = "\u{32c}"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcFrontStatusField {
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub LastReportDate: TThostFtdcDateType,
    #[doc = ""]
    pub LastReportTime: TThostFtdcTimeType,
    #[doc = ""]
    pub IsActive: TThostFtdcBoolType,
}
#[test]
fn bindgen_test_layout_CThostFtdcFrontStatusField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcFrontStatusField>(),
        28usize,
        concat!("Size of: ", stringify!(CThostFtdcFrontStatusField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcFrontStatusField>(),
        4usize,
        concat!("Alignment of ", stringify!(CThostFtdcFrontStatusField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcFrontStatusField>())).FrontID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcFrontStatusField>())).LastReportDate as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(LastReportDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcFrontStatusField>())).LastReportTime as *const _
                as usize
        },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(LastReportTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcFrontStatusField>())).IsActive as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcFrontStatusField),
            "::",
            stringify!(IsActive)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcUserPasswordUpdateField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OldPassword: TThostFtdcPasswordType,
    #[doc = ""]
    pub NewPassword: TThostFtdcPasswordType,
}
#[test]
fn bindgen_test_layout_CThostFtdcUserPasswordUpdateField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcUserPasswordUpdateField>(),
        109usize,
        concat!("Size of: ", stringify!(CThostFtdcUserPasswordUpdateField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcUserPasswordUpdateField>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(CThostFtdcUserPasswordUpdateField)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserPasswordUpdateField>())).BrokerID as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserPasswordUpdateField>())).UserID as *const _
                as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserPasswordUpdateField>())).OldPassword as *const _
                as usize
        },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(OldPassword)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcUserPasswordUpdateField>())).NewPassword as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcUserPasswordUpdateField),
            "::",
            stringify!(NewPassword)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcInputOrderField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub OrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = "\u{5b9}"]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub UserForceClose: TThostFtdcBoolType,
    #[doc = ""]
    pub IsSwapOrder: TThostFtdcBoolType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = "\u{5b4}"]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = "IP\u{5b7}"]
    pub IPAddress: TThostFtdcIPAddressType,
    #[doc = "Mac\u{5b7}"]
    pub MacAddress: TThostFtdcMacAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcInputOrderField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcInputOrderField>(),
        272usize,
        concat!("Size of: ", stringify!(CThostFtdcInputOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcInputOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcInputOrderField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).BrokerID as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).InvestorID as *const _ as usize
        },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).InstrumentID as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).OrderRef as *const _ as usize
        },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(OrderRef)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).UserID as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).OrderPriceType as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).Direction as *const _ as usize
        },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).CombOffsetFlag as *const _
                as usize
        },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CombOffsetFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).CombHedgeFlag as *const _ as usize
        },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CombHedgeFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).LimitPrice as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(LimitPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).VolumeTotalOriginal as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(VolumeTotalOriginal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).TimeCondition as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(TimeCondition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).GTDDate as *const _ as usize
        },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(GTDDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).VolumeCondition as *const _
                as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(VolumeCondition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).MinVolume as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(MinVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).ContingentCondition as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ContingentCondition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).StopPrice as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(StopPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).ForceCloseReason as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ForceCloseReason)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).IsAutoSuspend as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IsAutoSuspend)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).BusinessUnit as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(BusinessUnit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).RequestID as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(RequestID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).UserForceClose as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(UserForceClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).IsSwapOrder as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IsSwapOrder)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).ExchangeID as *const _ as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).InvestUnitID as *const _ as usize
        },
        189usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).AccountID as *const _ as usize
        },
        206usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).CurrencyID as *const _ as usize
        },
        219usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).ClientID as *const _ as usize
        },
        223usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).IPAddress as *const _ as usize
        },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(IPAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcInputOrderField>())).MacAddress as *const _ as usize
        },
        250usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcInputOrderField),
            "::",
            stringify!(MacAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct CThostFtdcOrderField {
    #[doc = "\u{379}"]
    pub BrokerID: TThostFtdcBrokerIDType,
    #[doc = ""]
    pub InvestorID: TThostFtdcInvestorIDType,
    #[doc = ""]
    pub InstrumentID: TThostFtdcInstrumentIDType,
    #[doc = ""]
    pub OrderRef: TThostFtdcOrderRefType,
    #[doc = ""]
    pub UserID: TThostFtdcUserIDType,
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = "\u{5b9}"]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = "\u{32c}"]
    pub OrderSubmitStatus: TThostFtdcOrderSubmitStatusType,
    #[doc = ""]
    pub NotifySequence: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub OrderSysID: TThostFtdcOrderSysIDType,
    #[doc = ""]
    pub OrderSource: TThostFtdcOrderSourceType,
    #[doc = "\u{32c}"]
    pub OrderStatus: TThostFtdcOrderStatusType,
    #[doc = ""]
    pub OrderType: TThostFtdcOrderTypeType,
    #[doc = ""]
    pub VolumeTraded: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeTotal: TThostFtdcVolumeType,
    #[doc = ""]
    pub InsertDate: TThostFtdcDateType,
    #[doc = ""]
    pub InsertTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTime: TThostFtdcTimeType,
    #[doc = ""]
    pub SuspendTime: TThostFtdcTimeType,
    #[doc = "\u{7b8}"]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CancelTime: TThostFtdcTimeType,
    #[doc = "\u{7b8}"]
    pub ActiveTraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ClearingPartID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub FrontID: TThostFtdcFrontIDType,
    #[doc = ""]
    pub SessionID: TThostFtdcSessionIDType,
    #[doc = ""]
    pub UserProductInfo: TThostFtdcProductInfoType,
    #[doc = "\u{32c}"]
    pub StatusMsg: TThostFtdcErrorMsgType,
    #[doc = ""]
    pub UserForceClose: TThostFtdcBoolType,
    #[doc = ""]
    pub ActiveUserID: TThostFtdcUserIDType,
    #[doc = "\u{379}"]
    pub BrokerOrderSeq: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub RelativeOrderSysID: TThostFtdcOrderSysIDType,
    #[doc = "\u{5a3}"]
    pub ZCETotalTradedVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub IsSwapOrder: TThostFtdcBoolType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = ""]
    pub InvestUnitID: TThostFtdcInvestUnitIDType,
    #[doc = ""]
    pub AccountID: TThostFtdcAccountIDType,
    #[doc = "\u{5b4}"]
    pub CurrencyID: TThostFtdcCurrencyIDType,
    #[doc = "IP\u{5b7}"]
    pub IPAddress: TThostFtdcIPAddressType,
    #[doc = "Mac\u{5b7}"]
    pub MacAddress: TThostFtdcMacAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcOrderField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcOrderField>(),
        656usize,
        concat!("Size of: ", stringify!(CThostFtdcOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcOrderField))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).BrokerID as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BrokerID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).InvestorID as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InvestorID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).InstrumentID as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InstrumentID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderRef as *const _ as usize },
        55usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderRef)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).UserID as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderPriceType as *const _ as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).Direction as *const _ as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(Direction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).CombOffsetFlag as *const _ as usize
        },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CombOffsetFlag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).CombHedgeFlag as *const _ as usize
        },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CombHedgeFlag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).LimitPrice as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(LimitPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).VolumeTotalOriginal as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTotalOriginal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).TimeCondition as *const _ as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TimeCondition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).GTDDate as *const _ as usize },
        109usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(GTDDate)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).VolumeCondition as *const _ as usize
        },
        118usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeCondition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).MinVolume as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(MinVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ContingentCondition as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ContingentCondition)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).StopPrice as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(StopPrice)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ForceCloseReason as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ForceCloseReason)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).IsAutoSuspend as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IsAutoSuspend)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).BusinessUnit as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BusinessUnit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).RequestID as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(RequestID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderLocalID as *const _ as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderLocalID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).ExchangeID as *const _ as usize },
        185usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ExchangeID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ParticipantID as *const _ as usize
        },
        194usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ParticipantID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).ClientID as *const _ as usize },
        205usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ClientID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ExchangeInstID as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ExchangeInstID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).TraderID as *const _ as usize },
        247usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TraderID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).InstallID as *const _ as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InstallID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderSubmitStatus as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSubmitStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).NotifySequence as *const _ as usize
        },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(NotifySequence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).TradingDay as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(TradingDay)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).SettlementID as *const _ as usize
        },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SettlementID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderSysID as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSysID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderSource as *const _ as usize
        },
        317usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderStatus as *const _ as usize
        },
        318usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderStatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).OrderType as *const _ as usize },
        319usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(OrderType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).VolumeTraded as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTraded)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).VolumeTotal as *const _ as usize
        },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(VolumeTotal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).InsertDate as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InsertDate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).InsertTime as *const _ as usize },
        337usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InsertTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).ActiveTime as *const _ as usize },
        346usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).SuspendTime as *const _ as usize
        },
        355usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SuspendTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).UpdateTime as *const _ as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UpdateTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).CancelTime as *const _ as usize },
        373usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CancelTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ActiveTraderID as *const _ as usize
        },
        382usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveTraderID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ClearingPartID as *const _ as usize
        },
        403usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ClearingPartID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).SequenceNo as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SequenceNo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).FrontID as *const _ as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(FrontID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).SessionID as *const _ as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(SessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).UserProductInfo as *const _ as usize
        },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserProductInfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).StatusMsg as *const _ as usize },
        439usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(StatusMsg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).UserForceClose as *const _ as usize
        },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(UserForceClose)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ActiveUserID as *const _ as usize
        },
        524usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ActiveUserID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).BrokerOrderSeq as *const _ as usize
        },
        540usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BrokerOrderSeq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).RelativeOrderSysID as *const _ as usize
        },
        544usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(RelativeOrderSysID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).ZCETotalTradedVolume as *const _
                as usize
        },
        568usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(ZCETotalTradedVolume)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).IsSwapOrder as *const _ as usize
        },
        572usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IsSwapOrder)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).BranchID as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(BranchID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcOrderField>())).InvestUnitID as *const _ as usize
        },
        585usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(InvestUnitID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).AccountID as *const _ as usize },
        602usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(AccountID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).CurrencyID as *const _ as usize },
        615usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(CurrencyID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).IPAddress as *const _ as usize },
        619usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(IPAddress)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CThostFtdcOrderField>())).MacAddress as *const _ as usize },
        635usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcOrderField),
            "::",
            stringify!(MacAddress)
        )
    );
}
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CThostFtdcExchangeOrderField {
    #[doc = ""]
    pub OrderPriceType: TThostFtdcOrderPriceTypeType,
    #[doc = ""]
    pub Direction: TThostFtdcDirectionType,
    #[doc = ""]
    pub CombOffsetFlag: TThostFtdcCombOffsetFlagType,
    #[doc = ""]
    pub CombHedgeFlag: TThostFtdcCombHedgeFlagType,
    #[doc = ""]
    pub LimitPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub VolumeTotalOriginal: TThostFtdcVolumeType,
    #[doc = ""]
    pub TimeCondition: TThostFtdcTimeConditionType,
    #[doc = "GTD"]
    pub GTDDate: TThostFtdcDateType,
    #[doc = ""]
    pub VolumeCondition: TThostFtdcVolumeConditionType,
    #[doc = ""]
    pub MinVolume: TThostFtdcVolumeType,
    #[doc = ""]
    pub ContingentCondition: TThostFtdcContingentConditionType,
    #[doc = "\u{5b9}"]
    pub StopPrice: TThostFtdcPriceType,
    #[doc = ""]
    pub ForceCloseReason: TThostFtdcForceCloseReasonType,
    #[doc = ""]
    pub IsAutoSuspend: TThostFtdcBoolType,
    #[doc = ""]
    pub BusinessUnit: TThostFtdcBusinessUnitType,
    #[doc = ""]
    pub RequestID: TThostFtdcRequestIDType,
    #[doc = ""]
    pub OrderLocalID: TThostFtdcOrderLocalIDType,
    #[doc = ""]
    pub ExchangeID: TThostFtdcExchangeIDType,
    #[doc = ""]
    pub ParticipantID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub ClientID: TThostFtdcClientIDType,
    #[doc = ""]
    pub ExchangeInstID: TThostFtdcExchangeInstIDType,
    #[doc = ""]
    pub TraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub InstallID: TThostFtdcInstallIDType,
    #[doc = "\u{32c}"]
    pub OrderSubmitStatus: TThostFtdcOrderSubmitStatusType,
    #[doc = ""]
    pub NotifySequence: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub TradingDay: TThostFtdcDateType,
    #[doc = ""]
    pub SettlementID: TThostFtdcSettlementIDType,
    #[doc = ""]
    pub OrderSysID: TThostFtdcOrderSysIDType,
    #[doc = ""]
    pub OrderSource: TThostFtdcOrderSourceType,
    #[doc = "\u{32c}"]
    pub OrderStatus: TThostFtdcOrderStatusType,
    #[doc = ""]
    pub OrderType: TThostFtdcOrderTypeType,
    #[doc = ""]
    pub VolumeTraded: TThostFtdcVolumeType,
    #[doc = ""]
    pub VolumeTotal: TThostFtdcVolumeType,
    #[doc = ""]
    pub InsertDate: TThostFtdcDateType,
    #[doc = ""]
    pub InsertTime: TThostFtdcTimeType,
    #[doc = ""]
    pub ActiveTime: TThostFtdcTimeType,
    #[doc = ""]
    pub SuspendTime: TThostFtdcTimeType,
    #[doc = "\u{7b8}"]
    pub UpdateTime: TThostFtdcTimeType,
    #[doc = ""]
    pub CancelTime: TThostFtdcTimeType,
    #[doc = "\u{7b8}"]
    pub ActiveTraderID: TThostFtdcTraderIDType,
    #[doc = ""]
    pub ClearingPartID: TThostFtdcParticipantIDType,
    #[doc = ""]
    pub SequenceNo: TThostFtdcSequenceNoType,
    #[doc = ""]
    pub BranchID: TThostFtdcBranchIDType,
    #[doc = "IP\u{5b7}"]
    pub IPAddress: TThostFtdcIPAddressType,
    #[doc = "Mac\u{5b7}"]
    pub MacAddress: TThostFtdcMacAddressType,
}
#[test]
fn bindgen_test_layout_CThostFtdcExchangeOrderField() {
    assert_eq!(
        ::std::mem::size_of::<CThostFtdcExchangeOrderField>(),
        392usize,
        concat!("Size of: ", stringify!(CThostFtdcExchangeOrderField))
    );
    assert_eq!(
        ::std::mem::align_of::<CThostFtdcExchangeOrderField>(),
        8usize,
        concat!("Alignment of ", stringify!(CThostFtdcExchangeOrderField))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeOrderField>())).OrderPriceType as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CThostFtdcExchangeOrderField),
            "::",
            stringify!(OrderPriceType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<CThostFtdcExchangeOrderField>())).Direction as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
